Debjit230/ESP8266-EXPERIMENT/src/main.cpp
    display.display();
    return;
  }

  // 2. SLEEPING STATE
  if (currentEmotion == EMO_SLEEP) {
    display.fillRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 3, SSD1306_WHITE);
    display.fillRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 3, SSD1306_WHITE);

    if (now - lastZzzAnim > 350) {
      lastZzzAnim = now;
      zzzStep = (zzzStep + 1) % 4;
    }
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    if (zzzStep >= 1) { display.setCursor(98, 24); display.print("z"); }
    if (zzzStep >= 2) { display.setCursor(106, 15); display.print("Z"); }
    if (zzzStep >= 3) { display.setCursor(114, 6);  display.print("Z"); }

    display.display();
    return;
  }

  // 3. SHOCKED STATE
  if (currentEmotion == EMO_SHOCKED) {
    display.fillCircle(leftEyeBaseX + 14, eyeBaseY + 15, 17, SSD1306_WHITE);
    display.fillCircle(rightEyeBaseX + 14, eyeBaseY + 15, 17, SSD1306_WHITE);
    display.fillCircle(leftEyeBaseX + 14, eyeBaseY + 15, 5, SSD1306_BLACK);
    display.fillCircle(rightEyeBaseX + 14, eyeBaseY + 15, 5, SSD1306_BLACK);

    display.display();
    return;
  }

  // 4. SUSPICIOUS / SQUINT STATE
  if (currentEmotion == EMO_SUSPICIOUS) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);

    display.fillTriangle(leftEyeBaseX, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 15, SSD1306_BLACK);
    display.fillTriangle(rightEyeBaseX, eyeBaseY + 8, rightEyeBaseX + eyeW, eyeBaseY + 8, rightEyeBaseX, eyeBaseY + 15, SSD1306_BLACK);

    display.display();
    return;
  }

  // 5. WINK STATE
  if (currentEmotion == EMO_WINK) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY, eyeW, 30, 7, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 4, 2, SSD1306_WHITE);

    display.display();
    return;
  }

  // 6. NORMAL IDLE STATE
  if (!isBlinking && (now - lastEyeAnim > random(2500, 5000))) {
    isBlinking = true;
    blinkStartTime = now;
    lastEyeAnim = now;

    eyeOffsetX = random(-7, 8);
    eyeOffsetY = random(-4, 5);
  }

  if (isBlinking) {
    if (now - blinkStartTime < 100) {
      eyeHeight = 4;
    } else {
      isBlinking = false;
      eyeHeight = 30;
    }
  }

  int lx = constrain(leftEyeBaseX + eyeOffsetX, 4, 46);
  int rx = constrain(rightEyeBaseX + eyeOffsetX, 54, 96);
  int y  = constrain(eyeBaseY + eyeOffsetY, 6, 28);

  display.fillRoundRect(lx, y + (30 - eyeHeight) / 2, eyeW, eyeHeight, 7, SSD1306_WHITE);
  display.fillRoundRect(rx, y + (30 - eyeHeight) / 2, eyeW, eyeHeight, 7, SSD1306_WHITE);

  display.display();
}

void drawClockUI() {
  time_t now = time(nullptr);
  struct tm* timeinfo = localtime(&now);

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);

  char timeStr[10];
  int hour12 = timeinfo->tm_hour % 12;
  if (hour12 == 0) hour12 = 12;
  const char* ampm = (timeinfo->tm_hour >= 12) ? "PM" : "AM";

  snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hour12, timeinfo->tm_min, timeinfo->tm_sec);

  display.setTextSize(2);
  display.setCursor(4, 14);
  display.print(timeStr);

  display.setTextSize(1);
  display.setCursor(104, 20);
  display.print(ampm);

  const char* days[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
  const char* months[] = {"Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};

  display.setTextSize(1);
  display.setCursor(6, 40);
  display.printf("%s, %02d %s %04d", 
                 days[timeinfo->tm_wday], 
                 timeinfo->tm_mday, 
                 months[timeinfo->tm_mon], 
                 timeinfo->tm_year + 1900);

  display.display();
}

void drawConfigUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.println("--- AP CONFIG ---");
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

  display.setCursor(0, 14);
  display.println("SSID: ESP-Sentinel");
  display.setCursor(0, 26);
  display.println("Pass: 12345678");

  display.setCursor(0, 40);
  display.println("Open in Browser:");
  display.setCursor(0, 52);
  display.println("http://192.168.4.1");

  display.display();
}

void drawRadarUI() {
  display.clearDisplay();

  const int centerX = 40;
  const int centerY = 32;
  const int maxRadius = 30;

  display.drawCircle(centerX, centerY, 10, SSD1306_WHITE);
  display.drawCircle(centerX, centerY, 20, SSD1306_WHITE);
  display.drawCircle(centerX, centerY, maxRadius, SSD1306_WHITE);
  display.drawLine(centerX - maxRadius, centerY, centerX + maxRadius, centerY, SSD1306_WHITE);
  display.drawLine(centerX, centerY - maxRadius, centerX, centerY + maxRadius, SSD1306_WHITE);

  int sweepX = centerX + cos(sweepAngle) * maxRadius;
  int sweepY = centerY + sin(sweepAngle) * maxRadius;
  display.drawLine(centerX, centerY, sweepX, sweepY, SSD1306_WHITE);

  int activeCount = 0;
  int closestRSSI = -100;

  for (int i = 0; i < MAX_TARGETS; i++) {
    if (targets[i].active) {
      if (millis() - targets[i].lastSeen > 6000) {
        targets[i].active = false;
        continue;
      }
      activeCount++;
      if (targets[i].rssi > closestRSSI) {
        closestRSSI = targets[i].rssi;
      }

      int dist = map(targets[i].rssi, -95, -35, maxRadius - 2, 4);
      dist = constrain(dist, 4, maxRadius - 2);

      int tx = centerX + cos(targets[i].angle) * dist;
      int ty = centerY + sin(targets[i].angle) * dist;
      display.fillRect(tx - 1, ty - 1, 3, 3, SSD1306_WHITE);
    }
  }

  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(76, 4);
  display.print("RADAR");
  display.setCursor(76, 18);
  display.printf("CH: %2d", currentChannel);
  display.setCursor(76, 32);
  display.printf("TGT: %d", activeCount);
  display.setCursor(76, 46);
  if (activeCount > 0) {
    display.printf("%ddBm", closestRSSI);
  } else {
    display.print("SWEEP");
  }

  display.display();
}

void drawScannerUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.printf("NETWORKS FOUND: %d", totalNetworksFound);
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

